Catalogs/ПЛ_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_События</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ИсточникиСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРегламентнойПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ПериодичностьРегламентныхПроверок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодписки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_События/Forms/РедактированиеУсловий/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерСтроки", НомерСтрокиВладельца);
	
	ИдентификаторВладельца = Параметры.УникальныйИдентификатор;
	
	// Исходная схема компоновки данных копируется в редактируемую схему компоновки данных
	ПЛ_УведомленияОСобытиях.СкопироватьСхемуКомпоновкиДанных(АдресСхемыКомпоновкиУсловий, Параметры.АдресСхемыКомпоновкиДанных);
	
	Если ЗначениеЗаполнено(АдресСхемыКомпоновкиУсловий) Тогда
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий, Параметры.АдресНастроекКомпоновкиДанных);
	КонецЕсли;
	
	Если Параметры.Свойство("ТипИсточника", ТипОбъекта)
		И Параметры.Свойство("ИмяИсточника", Регистратор) Тогда
		
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			
			СтрокаЗаголовка = НСтр("ru = 'Справочник ""%Регистратор%""'");
			СинонимРегистратора = Метаданные["Справочники"][Регистратор].Синоним;
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		ИначеЕсли ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
			Или  ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
			
			СтрокаЗаголовка = НСтр("ru = 'Документ ""%Регистратор%""'");
			СинонимРегистратора = Метаданные["Документы"][Регистратор].Синоним;
			СтрокаЗаголовка = СтрЗаменить(СтрокаЗаголовка, "%Регистратор%", СинонимРегистратора);
			Элементы.ОбъектПроверки.Заголовок = СтрокаЗаголовка;
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("ДокументСсылка." + Регистратор));
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			Элементы.ОбъектПроверки.ОграничениеТипа = ОписаниеТипов;
			
		Иначе
			Элементы.Проверка.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Проверка.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИзмененаСхемаКомпоновкиДанных(ВыбранноеЗначение, АдресСхемыКомпоновкиУсловий, КомпоновщикУсловий);
		УстановитьВидимость();
	#КонецЕсли
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбъектПроверкиПриИзменении(Элемент)
	
	Элементы.РезультатПроверки.Заголовок = "<>";
	Элементы.РезультатПроверки.ЦветТекста = Новый Цвет;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ЗавершитьРедактированиеУсловия();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	Если ЗначениеЗаполнено(ОбъектПроверки) Тогда
		ПроверитьУсловияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхему(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиУсловий)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		Предупреждение(НСтр("ru='Для редактирования схемы компоновки необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайла(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.ПолноеИмяФайла = "";
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		ВыборФайла.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		
		Если ВыборФайла.Выбрать() Тогда
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВыборФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			ЗагрузитьСхемуИзФайлаНаСервере(Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимость()
	
	ЕстьВидимыеПараметры = Ложь;
	Для каждого Элемент из КомпоновщикУсловий.Настройки.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
		Если Элемент.Видимость Тогда
			ЕстьВидимыеПараметры = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Параметры.Видимость = ЕстьВидимыеПараметры;
	
	Если КомпоновщикУсловий.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Количество() > 2 Тогда
		Элементы.УсловияНастройкиОтборДоступныеПоляОтбора.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
	Иначе
		Элементы.УсловияНастройкиОтборДоступныеПоляОтбора.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, УникальныйИдентификатор)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиУсловий, КомпоновщикУсловий);
		УстановитьВидимость();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиУсловий, КомпоновщикНастроек)
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиУсловий);
	
	// Компоновщик настроек инициализируется редактируемой схемой
	ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиУсловий);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	ПЛ_УведомленияОСобытиях.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеУсловия()
	
	Результат = Новый Структура;
	
	ЗаполнитьСтруктуруПараметровРедактированияУсловия(Результат, КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий, ИдентификаторВладельца);
	Результат.Вставить("НомерСтроки", НомерСтрокиВладельца);
	
	Если Не ЗначениеЗаполнено(НомерСтрокиВладельца) Тогда
		Оповестить("Завершено_редактирование_условий_события", Результат, ЭтаФорма);
	Иначе
		Оповестить("Завершено_редактирование_условий_получателя", Результат, ЭтаФорма);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСтруктуруПараметровРедактированияУсловия(Результат, КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий, ИдентификаторВладельца)
	
	// Настройки компоновщика настроек помещаются в редактируемую схему
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий);
	
	Результат.Вставить("АдресСхемы",       АдресСхемыКомпоновкиУсловий);
	Результат.Вставить("АдресНастроек",    ПолучитьНастройкиКомпоновщика(КомпоновщикУсловий, ИдентификаторВладельца));
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьУсловияНаСервере()
	
	// Настройки компоновщика настроек помещаются в редактируемую схему
	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикУсловий, АдресСхемыКомпоновкиУсловий);
	
	АдресНастроек = ПолучитьНастройкиКомпоновщика(КомпоновщикУсловий, ИдентификаторВладельца);
	
	Попытка
		Результат = ПЛ_УведомленияОСобытиях.ПроверитьУсловие(ТипОбъекта, ОбъектПроверки, АдресСхемыКомпоновкиУсловий, АдресНастроек);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		Элементы.РезультатПроверки.Заголовок = "ошибка!";
		Элементы.РезультатПроверки.ЦветТекста = Новый Цвет;
	ИначеЕсли Результат Тогда
		Элементы.РезультатПроверки.Заголовок = "условия пройдены";
		Элементы.РезультатПроверки.ЦветТекста = Метаданные.ЭлементыСтиля.ПЛ_ЦветПоложительный.Значение;
	Иначе
		Элементы.РезультатПроверки.Заголовок = "условия не пройдены";
		Элементы.РезультатПроверки.ЦветТекста = Метаданные.ЭлементыСтиля.ПЛ_ЦветОтрицательный.Значение;
	КонецЕсли;
	
КонецПроцедуры
